Конфигурация/src/AccumulationRegisters/БонусныеБаллыКлиентов/БонусныеБаллыКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>БонусныеБаллыКлиентов</name>
  <resources>
    <name>СуммаБаллов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Конфигурация/src/Enums/ВидНоменклатуры/ВидНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидНоменклатуры</name>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
  </enumValues>
</mdclass:Enum>

Конфигурация/src/Documents/Заказ/Заказ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Заказ</name>
  <registerRecords>AccumulationRegister.ДоставкиИОплаты</registerRecords>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <registerRecords>AccumulationRegister.БонусныеБаллыКлиентов</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Курьер</name>
    <type>
      <types>CatalogRef.Курьеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Транспорт</name>
    <type>
      <types>CatalogRef.Велосипеды</types>
    </type>
  </attributes>
  <attributes>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БаллыНаСписание</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаЗаказа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПозицииПродажи</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаЗаЕдиницу</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПозиции</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Конфигурация/src/Documents/ШкалаБонусов/ШкалаБонусов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ШкалаБонусов</name>
  <registerRecords>InformationRegister.ШкалаБонусов</registerRecords>
  <tabularSections>
    <name>Диапазоны</name>
    <attributes>
      <name>НижняяГраница</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВерхняяГраница</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентНакопления</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Конфигурация/src/CommonModules/ОбщийМодульВызовСервера/Module.bsl
// @strict-types

#Область ПрограммныйИнтерфейс

// Получить цену и вид номенклатуры.
// 
// Параметры:
//  Период - Дата
//  Номенклатура - СправочникСсылка.Номенклатура - справочник "Номенклатура"
// 
// Возвращаемое значение:
//  Структура - Получить цену и вид номенклатуры:
// * ИмяВидаНоменклатуры - Строка
// * Цена - Число
Функция ПолучитьЦенуИВидНоменклатуры(Период, Номенклатура) Экспорт
	
	ВидНоменклатуры = ПолучитьВидНоменклатуры(Номенклатура);
	ИндексНоменклатуры = Перечисления.ВидНоменклатуры.Индекс(ВидНоменклатуры);
	ИмяВидаНоменклатуры = Метаданные.Перечисления.ВидНоменклатуры.ЗначенияПеречисления[ИндексНоменклатуры].Имя;
	ЦенаНоменклатуры = ПолучитьЦенуНоменклатуры(Период, Номенклатура);
	Результат = Новый Структура("ИмяВидаНоменклатуры, Цена", ИмяВидаНоменклатуры, ЦенаНоменклатуры);

	Возврат Результат;
	
КонецФункции

// Получить текущую дату.
// 
// Возвращаемое значение:
//  Дата - Получить текущую дату
Функция ПолучитьТекущуюДату() Экспорт
	Возврат ТекущаяДатаСеанса();
КонецФункции

// Получить информацию о клиенте.
// 
// Параметры:
//  ОбъектСсылка - ДокументСсылка.Заказ
//  ДатаЗаказа - Дата
//  Клиент - СправочникСсылка.Клиенты
//  Цена - Число - Цена для проверяемого заказа до скидки
// 
// Возвращаемое значение:
//  Структура - Получить информацию о клиенте:
// * ЗначениеЗаполнено - Булево
// * СуммаБалловОстаток - Число
// * ПроцентНакопления - Число
// * БаллыКНакоплению - Число
// * Адрес - Строка
Функция ПолучитьИнформациюОКлиенте(ОбъектСсылка, ДатаЗаказа, Клиент, Цена) Экспорт
	
	Перем МоментВремениЗаказа; // МоментВремени
	
	Ответ = Новый Структура;
	Ответ.Вставить("ЗначениеЗаполнено", Истина);
	Ответ.Вставить("СуммаБалловОстаток", 0);
	Ответ.Вставить("ПроцентНакопления", 0);
	Ответ.Вставить("БаллыКНакоплению", 0);
	Ответ.Вставить("Адрес", "");
	
	Если Не ЗначениеЗаполнено(ОбъектСсылка) Тогда

		// Обработка
		Если Не ЗначениеЗаполнено(ДатаЗаказа) Тогда
			ДатаЗаказа = ПолучитьТекущуюДату();
		КонецЕсли;
		
		// Новый документ
		МоментВремениЗаказа = Новый МоментВремени(ДатаЗаказа);

	Иначе
		
		// Записанный документ
		МоментВремениЗаказа = ОбъектСсылка.МоментВремени();
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Клиент) Тогда
		
		Ответ.ЗначениеЗаполнено = Ложь;
		Возврат Ответ;
		
	КонецЕсли;

		Ответ.СуммаБалловОстаток = ПолучитьСуммуБаллов(МоментВремениЗаказа, Клиент);

		СуммаПокупок = ПолучитьСуммуПокупок(Новый Граница(МоментВремениЗаказа, ВидГраницы.Исключая), Клиент);
		ПроцентНакопления = ПолучитьПроцентНакопления(
			НачалоДня(ДатаЗаказа),
			СуммаПокупок
		);

		Ответ.ПроцентНакопления = ПроцентНакопления;
		
		БаллыКНакоплению = ПолучитьБаллыКНакоплениюЧерезПроцент(
			ПроцентНакопления,
			Цена
		);
		
		Ответ.БаллыКНакоплению = БаллыКНакоплению;
		Ответ.Адрес = ВернутьАдресКлиента(Клиент);

	Возврат Ответ;
	
КонецФункции

// Вернуть адрес клиента.
// 
// Параметры:
//  Клиент - СправочникСсылка.Клиенты
// 
// Возвращаемое значение:
//  Строка - Вернуть адрес клиента
Функция ВернутьАдресКлиента(Клиент) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Клиенты.Адрес КАК Адрес
		|ИЗ
		|	Справочник.Клиенты КАК Клиенты
		|ГДЕ
		|	Клиенты.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Клиент);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Адрес;
	КонецЕсли;
	
КонецФункции

// Получить отрицательную сумму баллов на период.
// 
// Параметры:
//  Период - Дата
//  Клиент - СправочникСсылка.Клиенты
// 
// Возвращаемое значение:
//  Число - Возвращает Число или Неопределено, если данных нет
Функция ПолучитьОтрицательнуюСуммуБалловНаПериод(Период, Клиент) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	БонусныеБаллыКлиентовОстатки.СуммаБалловОстаток КАК СуммаБалловОстаток
		|ИЗ
		|	РегистрНакопления.БонусныеБаллыКлиентов.Остатки(&Период, Клиент = &Клиент) КАК БонусныеБаллыКлиентовОстатки
		|ГДЕ
		|	БонусныеБаллыКлиентовОстатки.СуммаБалловОстаток < 0";
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Клиент", Клиент);
		
	Выборка = Запрос.Выполнить().Выбрать();

	Если Выборка.Следующий() Тогда
		
		Возврат Выборка.СуммаБалловОстаток;
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли
	
КонецФункции

// Получить баллы к накоплению, передавая параметром клиента.
// 
// Параметры:
//  ВремяДоЗаказа - Дата - Время до заказа
//  Клиент - СправочникСсылка.Клиенты - Клиент
//  ДатаЗаказа - Дата - Дата заказа
//  ЦенаЗаказа - Число - Цена заказа
// 
// Возвращаемое значение:
//  Число - Баллы к накоплению
Функция ПолучитьБаллыКНакоплениюЧерезКлиента(ВремяДоЗаказа, Клиент, ДатаЗаказа, ЦенаЗаказа) Экспорт
	
	СуммаПокупок = ПолучитьСуммуПокупок(ВремяДоЗаказа, Клиент);
	ПроцентНакопления = ПолучитьПроцентНакопления(ДатаЗаказа, СуммаПокупок);
	БаллыКНакоплению = ЦенаЗаказа * ПроцентНакопления / 100;
	БаллыКНакоплениюДваЗнака = ОбщиеФункцииКлиентСервер.ОбрезатьДробнуюЧастьДоДвухЗнаков(БаллыКНакоплению);
	
	Возврат БаллыКНакоплениюДваЗнака;
	
КонецФункции

// Получить баллы к накоплению, передавая параметром ранее рассчитанный ПроцентНакопления.
// 
// Параметры:
//  ПроцентНакопления - Число
//  ЦенаЗаказа - Число
// 
// Возвращаемое значение:
//  Число - Баллы к накоплению
Функция ПолучитьБаллыКНакоплениюЧерезПроцент(ПроцентНакопления, ЦенаЗаказа) Экспорт

	БаллыКНакоплению = ЦенаЗаказа * ПроцентНакопления / 100;
	БаллыКНакоплениюДваЗнака = ОбщиеФункцииКлиентСервер.ОбрезатьДробнуюЧастьДоДвухЗнаков(БаллыКНакоплению);
	
	Возврат БаллыКНакоплениюДваЗнака;
	
КонецФункции

// Заполнить наиболее часто заказываемые товары.
//
// Параметры:
//  ОбъектДляЗаполнения - ФормаКлиентскогоПриложения
//  КоллекцияИзбранныхТоваров - ДанныеФормыКоллекция из ДанныеФормыЭлементКоллекции:
//   * Активность - Булево
//   * Номенклатура - СправочникСсылка.Номенклатура
//   * Цена - Число
//  Клиент - СправочникСсылка.Клиенты
Процедура ЗаполнитьИзбранныеТовары(ОбъектДляЗаполнения, КоллекцияИзбранныхТоваров, Клиент) Экспорт

	СброситьИзбранныеТовары(КоллекцияИзбранныхТоваров);
	
	Если ЗначениеЗаполнено(Клиент) Тогда

		НачалоПериода = ДобавитьМесяц(ТекущаяДатаСеанса(), -3);
		КонецПериода = ТекущаяДатаСеанса();
		ИзбранныеТоварыВыборка = ПолучитьИзбранныеТовары(НачалоПериода, КонецПериода, Клиент);
		
		Счётчик = 0;
		
		Пока ИзбранныеТоварыВыборка.Следующий() Цикл

			ТекущаяСтрокаКоллекции = КоллекцияИзбранныхТоваров[Счётчик];
			ТекущаяСтрокаКоллекции.Активность = Истина;
			ТекущаяСтрокаКоллекции.Номенклатура = ИзбранныеТоварыВыборка.Товар;
			ТекущаяСтрокаКоллекции.Цена = ИзбранныеТоварыВыборка.Цена;
			
			Счётчик = Счётчик + 1;
			
		КонецЦикла;

	КонецЕсли;
	
	ЗаполнитьДекорацииИзбранныхТоваров(КоллекцияИзбранныхТоваров, ОбъектДляЗаполнения.Элементы);
	
КонецПроцедуры

// Придать начальный вид.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения:
//    * ДинамическиеЭлементы - ДанныеФормыКоллекция
//    * Клиент - СправочникСсылка.Клиенты
//  ДанныеФормы - ДанныеФормыСтруктура:
//    * Клиент - СправочникСсылка.Клиенты
//  Элементы - ВсеЭлементыФормы
Процедура ПридатьНачальныйВидФормеЗаказа(Форма, ДанныеФормы, Элементы) Экспорт

	ОбъектСВидимымиПолями = Неопределено;
	
	// Когда форма Документа
	Если ДанныеФормы.Свойство("Клиент") Тогда
		ОбъектСВидимымиПолями = ДанныеФормы;
	// Когда форма Обработки
	Иначе
		ОбъектСВидимымиПолями = Форма;
	КонецЕсли;
	
	Элементы.ДекорацияБаллыКлиента.Видимость = Ложь;

	ЗаполнитьИзбранныеТовары(Форма, Форма.ДинамическиеЭлементы, ОбъектСВидимымиПолями.Клиент);

КонецПроцедуры

// Очистить форму.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения:
//    * Клиент - СправочникСсылка.Клиенты
//    * Цена - Число
//    * БаллыНаСписание - Число
//    * СуммаЗаказа - Число
//    * ПозицииПродажи - ДанныеФормыКоллекция
//  ДанныеФормы - ДанныеФормыСтруктура
//  Элементы - ВсеЭлементыФормы
Процедура ОчиститьФорму(Форма, ДанныеФормы, Элементы) Экспорт
	
	Форма.Клиент = Справочники.Клиенты.ПустаяСсылка();
	ПридатьНачальныйВидФормеЗаказа(Форма, ДанныеФормы, Элементы);
	Форма.Цена = 0;
	Форма.БаллыНаСписание = 0;
	Форма.СуммаЗаказа = 0;
	Форма.ПозицииПродажи.Очистить();
	
КонецПроцедуры

// Создать декорации избранных товаров.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения:
//    * ДинамическиеЭлементы - ДанныеФормыКоллекция
//  Элементы - ВсеЭлементыФормы
Процедура СоздатьДекорацииИзбранныхТоваров(Форма, Элементы) Экспорт
	
	КоличествоИзбранныхТоваров = ПолучитьЧислоИзбранныхТоваров();
	
	Для Сч = 1 По КоличествоИзбранныхТоваров Цикл
		
		ИмяДекорации = "ДекорацияИзбранного_" + XMLСтрока(Сч);
		Декорация = Элементы.Добавить(
			ИмяДекорации,
			Тип("ДекорацияФормы"),
			Элементы.ГруппаПопулярныеПокупки
		);
		Декорация.Вид = ВидДекорацииФормы.Надпись;
		Декорация.Видимость = Ложь;
		Декорация.Гиперссылка = Истина;
		Декорация.УстановитьДействие("Нажатие", "Подключаемый_ДекорацияИзбранныхТоваровНажатие");

		СтрокаОписанияДекорации = ДобавитьДинамическийЭлемент(Форма);
		СтрокаОписанияДекорации.ИмяЭлемента = ИмяДекорации;
		
	КонецЦикла;
	
КонецПроцедуры

// Получить номенклатуру.
// 
// Возвращаемое значение:
//  ВыборкаИзРезультатаЗапроса - Получить номенклатуру:
// * Ссылка - СправочникСсылка.Номенклатура
// * ВидНоменклатуры - ПеречислениеСсылка.ВидНоменклатуры
// * Наименование - Строка
Функция ПолучитьНоменклатуру() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Ссылка,
		|	Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры,
		|	Номенклатура.Наименование КАК Наименование
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.ЭтоГруппа = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номенклатура.Код";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат Выборка;
	
КонецФункции

// Получить товары с ценой.
// 
// Параметры:
//  ТекущаяДата - Дата - 
// 
// Возвращаемое значение:
//  ВыборкаИзРезультатаЗапроса - Получить товары с ценой:
// * СсылкаНаНоменклатуру - СправочникСсылка.Номенклатура
// * Цена - Число
Функция ПолучитьТоварыСЦеной(ТекущаяДата) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	НоменклатураСправочник.Ссылка КАК СсылкаНаНоменклатуру,
		|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ТекущаяДата,) КАК ЦеныНоменклатурыСрезПоследних
		|		ПРАВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураСправочник
		|		ПО ЦеныНоменклатурыСрезПоследних.Номенклатура = НоменклатураСправочник.Ссылка
		|ГДЕ
		|	НоменклатураСправочник.ЭтоГруппа = ЛОЖЬ
		|	И НоменклатураСправочник.ВидНоменклатуры = &ВидНоменклатуры
		|УПОРЯДОЧИТЬ ПО
		|	НоменклатураСправочник.Код";
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата);
	Запрос.УстановитьПараметр("ВидНоменклатуры", Перечисления.ВидНоменклатуры.Товар);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат Выборка;
	
КонецФункции

// Получить структуру товара.
// 
// Параметры:
//  ВыборкаТоваровСЦеной см. ПолучитьТоварыСЦеной
// 
// Возвращаемое значение:
//  Структура - Получить структуру товара:
// * СсылкаНаНоменклатуру - СправочникСсылка.Номенклатура
// * Цена - Число
Функция ПолучитьСтруктуруТовара(ВыборкаТоваровСЦеной) Экспорт

	ТоварСтруктура = Новый Структура;
	ТоварСтруктура.Вставить("СсылкаНаНоменклатуру", ВыборкаТоваровСЦеной.СсылкаНаНоменклатуру);
	ТоварСтруктура.Вставить("Цена", ВыборкаТоваровСЦеной.Цена);
	Возврат ТоварСтруктура;
	
КонецФункции

// Генератор случайных дробных чисел.
// 
// Параметры:
//  Мин - Число
//  Макс - Число
//  ЗнаковПослеЗапятой - Число
// 
// Возвращаемое значение:
//  Число - Целое или дробное
Функция ГенераторСлучайныхДробныхЧисел(Мин, Макс, ЗнаковПослеЗапятой) Экспорт
	
	Минимум = ОбщиеФункцииКлиентСервер.ОбрезатьДробнуюЧасть(Мин, ЗнаковПослеЗапятой);
	Максимум = ОбщиеФункцииКлиентСервер.ОбрезатьДробнуюЧасть(Макс, ЗнаковПослеЗапятой);
	
    ГСЧ = Новый ГенераторСлучайныхЧисел();
    Точность = Pow(10, ЗнаковПослеЗапятой);
    Диапазон = (Максимум - Минимум) * Точность;
    СлучайноеЦелое = ГСЧ.СлучайноеЧисло(0, Диапазон);
    ДробноеВИскомомДиапазоне = Минимум + (СлучайноеЦелое / Точность);
    Возврат ДробноеВИскомомДиапазоне;

КонецФункции

// Получить дату последнего заказа.
// 
// Возвращаемое значение:
//  Дата - Получить дату последнего заказа
Функция ПолучитьДатуПоследнегоЗаказа() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	МАКСИМУМ(Заказ.Дата) КАК Дата
		|ИЗ
		|	Документ.Заказ КАК Заказ";
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Дата;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

// Получить заказы.
// 
// Возвращаемое значение:
//  ВыборкаИзРезультатаЗапроса - Получить заказы:
// * Дата - Дата - 
// * СуммаЗаказа - Число - 
// * Курьер - СправочникСсылка.Курьеры - 
// * Ссылка - ДокументСсылка.Заказ - 
Функция ПолучитьЗаказы() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Заказ.Дата КАК Дата,
		|	Заказ.СуммаЗаказа КАК СуммаЗаказа,
		|	Заказ.Курьер КАК Курьер,
		|	Заказ.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.Заказ КАК Заказ
		|
		|УПОРЯДОЧИТЬ ПО
		|	Заказ.Номер";
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат Выборка;
	
КонецФункции

// Вернуть текущего пользователя.
// 
// Возвращаемое значение:
//  СправочникСсылка.Пользователи - Вернуть текущего пользователя
Функция ВернутьТекущегоПользователя() Экспорт
	Возврат ПараметрыСеанса.ТекущийПользователь;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Добавить динамический элемент.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма:
//    * ДинамическиеЭлементы - ДанныеФормыКоллекция
// 
// Возвращаемое значение:
//  ДанныеФормыЭлементКоллекции:
//    * ИмяЭлемента - Строка
Функция ДобавитьДинамическийЭлемент(Форма)

	СтрокаОписанияДекорации = Форма.ДинамическиеЭлементы.Добавить();
	Возврат СтрокаОписанияДекорации;
	
КонецФункции

Функция ПолучитьВидНоменклатуры(Номенклатура)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Номенклатура);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ВидНоменклатуры;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьЦенуНоменклатуры(Период, Номенклатура)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&Период, Номенклатура = &Номенклатура) КАК
		|		ЦеныНоменклатурыСрезПоследних";
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Возврат Выборка.Цена;
	
	Иначе
		
		Возврат 0;
		
	КонецЕсли;
	
КонецФункции

Функция ПолучитьСуммуПокупок(КонецПериода, Клиент)
	
	 Запрос = Новый Запрос;
	 Запрос.Текст =
		 "ВЫБРАТЬ
		 |	ПродажиОбороты.СуммаОборот КАК СуммаОборот
		 |ИЗ
		 |	РегистрНакопления.Продажи.Обороты(, &КонецПериода,, Клиент = &Клиент) КАК ПродажиОбороты";
	 Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	 Запрос.УстановитьПараметр("Клиент", Клиент);
	 
	 Выборка = Запрос.Выполнить().Выбрать();
	 
	 Если Выборка.Следующий() Тогда

	 	Возврат Выборка.СуммаОборот;
	 	
	 Иначе
	 	
	 	Возврат 0;
	 
	 КонецЕсли;
	
КонецФункции

Функция ПолучитьПроцентНакопления(Период, СуммаПокупокКлиента)

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ШкалаБонусовДиапазоны.ПроцентНакопления КАК ПроцентНакопления
		|ИЗ
		|	РегистрСведений.ШкалаБонусов.СрезПоследних(&Период,) КАК ШкалаБонусовСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ШкалаБонусов.Диапазоны КАК ШкалаБонусовДиапазоны
		|		ПО ШкалаБонусовСрезПоследних.Шкала = ШкалаБонусовДиапазоны.Ссылка
		|ГДЕ
		|	ШкалаБонусовДиапазоны.НижняяГраница <= &СуммаПокупокКлиента
		|	И (ШкалаБонусовДиапазоны.ВерхняяГраница > &СуммаПокупокКлиента
		|	ИЛИ ШкалаБонусовДиапазоны.ВерхняяГраница = 0)";
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("СуммаПокупокКлиента", СуммаПокупокКлиента);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Возврат Выборка.ПроцентНакопления;
	
	Иначе
		
		Возврат 0;
		
	КонецЕсли;
	
КонецФункции

Функция ПолучитьСуммуБаллов(ДатаЗаказа, Клиент)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	БонусныеБаллыКлиентовОстатки.СуммаБалловОстаток КАК СуммаБалловОстаток
		|ИЗ
		|	РегистрНакопления.БонусныеБаллыКлиентов.Остатки(&ДатаЗаказа, Клиент = &Клиент) КАК БонусныеБаллыКлиентовОстатки";
	Запрос.УстановитьПараметр("ДатаЗаказа", ДатаЗаказа);
	Запрос.УстановитьПараметр("Клиент", Клиент);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.СуммаБалловОстаток;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

// Получить избранные товары.
// 
// Параметры:
//  НачалоПериода - Дата - Начало периода
//  КонецПериода - Дата - Конец периода
//  Клиент - СправочникСсылка.Клиенты - Клиент
// 
// Возвращаемое значение:
//  ВыборкаИзРезультатаЗапроса - Получить избранные товары:
// * ВидНоменклатуры - ПеречислениеСсылка.ВидНоменклатуры - 
// * Цена - Число - 
// * СуммаОборот - Число - 
// * ПроцентНакопления - Число - 
// * СуммаБалловОстаток - Число - 
// * Товар - СправочникСсылка.Номенклатура - 
// * Количество - Число - 
Функция ПолучитьИзбранныеТовары(НачалоПериода, КонецПериода, Клиент)

	//@skip-check bsl-ql-hub
	ШаблонЗапроса =
		"ВЫБРАТЬ ПЕРВЫЕ %1
		|	ПродажиОбороты.Товар КАК Товар,
		|	ПродажиОбороты.Количество КАК Количество,
		|	ПродажиОбороты.СуммаОборот КАК СуммаОборот,
		|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
		|ИЗ
		|	РегистрНакопления.Продажи.Обороты(&НачалоПериода, &КонецПериода,, Клиент = &Клиент) КАК ПродажиОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ТекущаяДата,) КАК ЦеныНоменклатурыСрезПоследних
		|		ПО ПродажиОбороты.Товар = ЦеныНоменклатурыСрезПоследних.Номенклатура
		|
		|УПОРЯДОЧИТЬ ПО
		|	Количество УБЫВ,
		|	СуммаОборот УБЫВ";
	ТекстЗапроса = СтрШаблон(ШаблонЗапроса, XMLСтрока(ПолучитьЧислоИзбранныхТоваров()));
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("Клиент", Клиент);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат Выборка;
	
КонецФункции

Функция ПолучитьЧислоИзбранныхТоваров()
	Возврат 3;
КонецФункции

Процедура СброситьИзбранныеТовары(ИзбранныеТовары)
	
	Для Каждого Строка Из ИзбранныеТовары Цикл
		
		Строка.Активность = Ложь;
		Строка.Номенклатура = Справочники.Номенклатура.ПустаяСсылка();
		
	КонецЦикла;
	
КонецПроцедуры

// Заполнить декорации избранных товаров.
// 
// Параметры:
//  КоллекцияИзбранныхТоваров - ДанныеФормыКоллекция из ДанныеФормыЭлементКоллекции:
//    * ИмяЭлемента - Строка
//    * Активность - Булево
//    * Номенклатура - СправочникСсылка.Номенклатура
//  Элементы - ВсеЭлементыФормы - Элементы
Процедура ЗаполнитьДекорацииИзбранныхТоваров(КоллекцияИзбранныхТоваров, Элементы)
	
	Для Каждого Строка Из КоллекцияИзбранныхТоваров Цикл

		Элемент = Элементы[Строка.ИмяЭлемента];
		Элемент.Видимость = Строка.Активность;
		Элемент.Заголовок = Строка(Строка.Номенклатура);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

//#Область СлужебныйПрограммныйИнтерфейс
//
//#КонецОбласти
